Section 12: Debugging/Section 12.tex
% Created 2021-08-05 Thu 11:54
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mohammed Asir Shahid}
\date{2021-08-04}
\title{Section 12\\\medskip
\large Debugging}
\hypersetup{
 pdfauthor={Mohammed Asir Shahid},
 pdftitle={Section 12},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{The raise and assert Statements}
\label{sec:orgcac53c1}

Now we might start finding some more complicated bugs. Debugging is a tool that we need to learn in order to find what we did wrong.

For example, a zero divide error occurs when we try to divide a number by 0. We learned how to handle exceptions with try and except statements to deal with expected errors.

\subsection{Raising Your Own Exceptions}
\label{sec:org0ba8097}

We can also raise our own exceptions in our code. This is a way of saying that Python should stop running the code in this function and move to the except statement.

We can raise exceptions using the raise statement.

\begin{verbatim}

raise Exception("This is the error message.")

\end{verbatim}

\subsection{Box Example}
\label{sec:org70b4ac5}

We want to create a function that creates a box using some supplied characters.


\begin{verbatim}

def boxPrint(symbol, width, height):

    if len(symbol)!=1:
        raise Exception("symbol needs to be of length 1")

    if width < 2 or height < 2:
        raise Exception("width and height must be greater than or equal to 2")

    print(symbol*width)

    for i in range(height-2):
        print(symbol + (" "*(width-2)) + symbol)

    print(symbol*width)

boxPrint("*", 15, 5)
boxPrint("O", 5, 20)

\end{verbatim}

\begin{verbatim}
***************
*             *
*             *
*             *
***************
OOOOO
O   O
O   O
O   O
O   O
O   O
O   O
O   O
O   O
O   O
O   O
O   O
O   O
O   O
O   O
O   O
O   O
O   O
O   O
OOOOO
\end{verbatim}

Our error message is called a traceback. This is because it shows information showing where the error occurred.

\section{The traceback.format\textsubscript{exc}() Function}
\label{sec:orgd53300c}

We can get the traceback error text as a string vale using this function.


\begin{verbatim}

import traceback

try:
    raise Exception("This is the error message.")
except:
    errorFile=open("error_log.txt","a")
    errorFile.write(traceback.format_exc())
    errorFile.close()
    print("The traceback info was written error_log.txt")

error=open("error_log.txt")
print(error.read())

\end{verbatim}

\begin{verbatim}
The traceback info was written error_log.txt
Traceback (most recent call last):
  File "<stdin>", line 5, in <module>
Exception: This is the error message.
Traceback (most recent call last):
  File "<stdin>", line 5, in <module>
Exception: This is the error message.
Traceback (most recent call last):
  File "<stdin>", line 5, in <module>
Exception: This is the error message.

\end{verbatim}

\subsection{Assertions and the assert Statement}
\label{sec:org48a4baf}

An assertion is a sanity check that makes sure the code isn't doing something really wrong. These are performed by assert statements. If the sanity check fails, then an assertion error exception is raised. These assertions are for programmer errors and the program should not run after an assertion is raised.

\begin{verbatim}

assert False, "This is the error message"

\end{verbatim}

Let's try to create a simple traffic simulator program with intersections with stop lights.

\begin{verbatim}

market_2nd={"ns": "green", "ew": "red"}

def switchLights(intersection):
    for key in intersection.keys():
        print(intersection[key])
        if intersection[key]=="green":
            intersection[key]="yellow"
        elif intersection[key]=="yellow":
            intersection[key]="red"
        elif intersection[key]=="red":
            intersection[key]="green"
    assert "red" in intersection.values(), "Neither light is red!"

print(market_2nd)
switchLights(market_2nd)
print(market_2nd)

\end{verbatim}
\end{document}
